# GetMEPSystems Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wire..::..GetMEPSystems Method
Wire Class See Also
---
Gets the systems to which the wire belongs.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public IList<ElementId> GetMEPSystems()
```

Visual Basic
---
```text
Public Function GetMEPSystems As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetMEPSystems()
```

# ### Return Value
The systems to which the wire belongs.
# Remarks
One wire might belong to more than one circuit.
# See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace